# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 dual-stream transformer fusion model (RGB + IR)

# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Dual-stream indicator
ch: 3

dual_fusion: transformer

# Backbone
backbone:
  # Stream 1 (RGB)
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  # Stream 2 (IR)
  - [-4, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  # Transformer fusion (P2)
  - [[2, 5], 1, GPT, [256]]
  - [[2, 6], 1, Add2, [256, 0]]
  - [[5, 6], 1, Add2, [256, 1]]

  # P3
  - [7, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [8, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]

  # Transformer fusion (P3)
  - [[10, 12], 1, GPT, [512]]
  - [[10, 13], 1, Add2, [512, 0]]
  - [[12, 13], 1, Add2, [512, 1]]

  # P4
  - [14, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [15, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]

  # Transformer fusion (P4)
  - [[17, 19], 1, GPT, [512]]
  - [[17, 20], 1, Add2, [512, 0]]
  - [[19, 20], 1, Add2, [512, 1]]

  # P5
  - [21, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

  - [22, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

  # Transformer fusion (P5)
  - [[26, 30], 1, GPT, [1024]]
  - [[26, 31], 1, Add2, [1024, 0]]
  - [[30, 31], 1, Add2, [1024, 1]]

  # Stream fusion outputs
  - [[14, 15], 1, Add, [1]]
  - [[21, 22], 1, Add, [1]]
  - [[32, 33], 1, Add, [1]]

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 35], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 34], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 39], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 36], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[42, 45, 48], 1, Detect, [nc]]
